app/views/home/index.html.erb

SELECT COUNT(*) FROM "quotations"
---
              <tbody>
                <% @users.map{|u| u}.sort_by{|e| -e.total_quotations}.each do |user| %>