app/views/quotations/_form.html.erb

SELECT  1 AS one FROM "quotations" WHERE "quotations"."company_id" = $1 LIMIT 1  [["company_id", 1]]
---
              <div class="large-9 columns">
                <%= @company.quotations.any? ? "No" : "Si" %>