app/views/quotations/index.html.erb

SELECT "users".* FROM "users"
---
            <div class="medium-9 large-10 columns">
              <%= select_tag "users", options_from_collection_for_select(@users, "id", "name", @filter_user.present? ? @filter_user.id : ''), include_blank: 'Todos' %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
                <td><%= quotation.date_approved.strftime(@date_format) if quotation.date_approved %></td>
                <td><%= User.find(quotation.user_appoved_id).name if quotation.user_appoved_id  %></td>