app/views/quotations/search.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
                <td><%= quotation.date_approved.strftime(@date_format) if quotation.date_approved %></td>
                <td><%= User.find(quotation.user_appoved_id).name if quotation.user_appoved_id  %></td>