app/views/quotations/show.html.erb

SELECT  1 AS one FROM "quotation_items" WHERE "quotation_items"."quotation_id" = $1 LIMIT 1  [["quotation_id", 2]]
SELECT "quotation_items".* FROM "quotation_items" WHERE "quotation_items"."quotation_id" = $1  [["quotation_id", 16]]
---
        </p>
        <% if @quotation.quotation_items.any? %>

SELECT  "exams".* FROM "exams" WHERE "exams"."id" = $1 LIMIT 1  [["id", 1]]
---
            <% @quotation.quotation_items.each do |quotation_item| %>
              <li> <%= quotation_item.exam.name if quotation_item.exam.present? %> </li>