app/controllers/companies_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = $1  ORDER BY "companies"."created_at" DESC LIMIT 20 OFFSET 0  [["user_id", 1]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "companies" WHERE "companies"."user_id" = $1 LIMIT 20 OFFSET 0) subquery_for_count  [["user_id", 1]]
SELECT  "companies".* FROM "companies" LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "companies" LIMIT 25 OFFSET 0) subquery_for_count
---
  def index
    unless current_user.rol == 3
      @companies = Company.where(:user_id => current_user.id).order(created_at: :desc).page(params[:page]).per(20)
    else
      @companies = Company.all.page params[:page]

INSERT INTO "companies" ("name", "ruc", "direcction", "sector", "contact_name", "contact_email", "doctor_name", "doctor_email", "billing_name", "billing_email", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
SELECT COUNT(*) FROM "users"
SELECT  "companies".* FROM "companies" WHERE "companies"."ruc" = $1  ORDER BY "companies"."id" ASC LIMIT 1  [["ruc", "1721050290"]]
SELECT  "companies".* FROM "companies" WHERE "companies"."name" = $1  ORDER BY "companies"."id" ASC LIMIT 1  [["name", "Empresa 1"]]
---
  def create
    @company = Company.new(company_params)
    @company.user_id = current_user.id
    respond_to do |format|
      if @company.save
        format.html { redirect_to @company, notice: 'Empresa creada correctamente.' }
        format.json { render :show, status: :created, location: @company }
      else
        @company.errors.full_messages.each do |error|
          if error.include?('Ruc') && error.include?('ya fue registrado en el sistema')
            company_created = Company.where(:ruc => params[:company][:ruc]).first
            if company_created
              @company.errors[:base] << "El ruc <strong>#{params[:company][:ruc]}</strong> fue registrado por el usuario: <strong>#{company_created.user.name}</strong> (#{company_created.user.email})".html_safe
              @company.errors.messages.delete(:ruc)
            end
          end
          if error.include?('Nombre') && error.include?('ya fue registrado en el sistema')
            company_created = Company.where(:name => params[:company][:name]).first

UPDATE "companies" SET "direcction" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["direcction", "asdfsadf"], ["updated_at", "2017-02-23 09:00:45.156855"], ["id", 5]]
---
  def update
    @company.user_id = current_user.id
    respond_to do |format|
      if @company.update(company_params)