app/controllers/exams_controller.rb

SELECT  "exams".* FROM "exams" LIMIT 12 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "exams" LIMIT 12 OFFSET 0) subquery_for_count
---
  def index
    @exams = Exam.all.page(params[:page]).per(12)

SELECT  "exams".* FROM "exams" WHERE "exams"."id" = $1 LIMIT 1  [["id", 3]]
---
  def get_values
    values = []
    @exam = Exam.find(params[:id])

SELECT  "exams".* FROM "exams" WHERE "exams"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_exam
      @exam = Exam.find(params[:id])