app/controllers/home_controller.rb

  def index
  	# if user_signed_in?
  	# 	# @companies = Company.where(:user_id => current_user.id)
   #    @search = Company.search(params[:q])
  	# 	@companies = @search.result.order(:created_at).reverse_order.page(params[:page]).per(10)
  	# else
  	# 	redirect_to new_user_session_path
  	# end

    #Admin
    @admin_pen_quotations = Quotation.where(:approved => false).order(:created_at).reverse_order

    if current_user.rol == 1
      #Al Uers
      @companies = Company.where(:user_id => current_user.id).order(:created_at).reverse_order.limit(12)
      company_ids = @companies.map{|c| c.id}
      @quotations = Quotation.where(:company_id => company_ids).order(:created_at).reverse_order
---
SELECT "quotations".* FROM "quotations" WHERE "quotations"."approved" = $1  ORDER BY "quotations"."created_at" DESC  [["approved", "f"]]
SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = $1  ORDER BY "companies"."created_at" DESC LIMIT 12  [["user_id", 4]]
SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = $1 LIMIT 12  [["user_id", 1]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "companies" LIMIT 12) subquery_for_count
SELECT "quotations".* FROM "quotations" WHERE "quotations"."company_id" = 5  ORDER BY "quotations"."created_at" DESC


    @users = User.all

    @users.map{|u| @total_approved = u.total_approved(@num_week)}
---
SELECT COUNT(*) FROM "users"