app/controllers/quotations_controller.rb

  def index
    @filter_by_company = false
    @quotations = Quotation.order(:created_at).reverse_order
    if @company.present?
      @quotations = @quotations.where(:company_id => @company.id)
      @filter_by_company = true
    else
      if params[:user].present?
        if params[:user] == "all"
          @quotations = @quotations.order(:created_at)
          @quotations_approved = @quotations.where(:approved => true).count
        else
          companies = Company.where(:user_id => params[:user].to_i)
          @filter_user = User.find(params[:user])
          company_ids = companies.map{|c| c.id}
          @quotations = @quotations.where(:company_id => company_ids).order(:created_at)
          @quotations_approved = @quotations.where(:approved => true).count
        end
      else
        companies            = Company.where(:user_id => current_user.id)
        @filter_user         = current_user
        company_ids          = companies.map{|c| c.id}
        @quotations          = @quotations.where(:company_id => company_ids).order(:created_at)
        @quotations_approved = @quotations.where(:approved => true).count
      end
    end

    @quotations = @quotations.page(params[:page]).per(12)
---
SELECT COUNT(*) FROM "quotations" WHERE "quotations"."company_id" = $1 AND "quotations"."company_id" = 1  [["company_id", 1]]
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "quotations" WHERE "quotations"."company_id" = 31 AND "quotations"."approved" = $1  [["approved", "t"]]
SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = $1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "users"
SELECT  "quotations".* FROM "quotations" WHERE "quotations"."company_id" = $1 AND "quotations"."company_id" = 1  ORDER BY "quotations"."created_at" ASC, "quotations"."created_at" DESC LIMIT 12 OFFSET 0  [["company_id", 1]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "quotations" WHERE "quotations"."company_id" = $1 AND "quotations"."company_id" = 1 AND "quotations"."approved" = $2 LIMIT 12 OFFSET 0) subquery_for_count  [["company_id", 1], ["approved", "t"]]

  def new
    @quotation = Quotation.new
    @quotation.total_users = 1
    @quotation.quotation_items.build unless @quotation.quotation_items.any?
---
SELECT COUNT(*) FROM "users"

  def edit
    if @quotation.approved || @quotation.rejected
      if @quotation.approved
        respond_to do |format|
          format.html { redirect_to current_user.rol == 1 ? quotations_path : quotations_path(:user => 'all'), alert: 'Cotización fue aprobada por ' + User.find(@quotation.user_appoved_id).name if @quotation.user_appoved_id }
          format.json { render :show, status: :ok, location: @quotation }
        end
      elsif @quotation.rejected
        respond_to do |format|
          format.html { redirect_to current_user.rol == 1 ? quotations_path : quotations_path(:user => 'all'), alert: 'Cotización fue rechazada' }
          format.json { render :show, status: :ok, location: @quotation }
        end
      end
    else
      @quotation.quotation_items.build unless @quotation.quotation_items.any?
      @company = @quotation.company unless @company.present?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "quotations".* FROM "quotations" WHERE "quotations"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  1 AS one FROM "quotation_items" WHERE "quotation_items"."quotation_id" = $1 LIMIT 1  [["quotation_id", 2]]
SELECT "quotation_items".* FROM "quotation_items" WHERE "quotation_items"."quotation_id" = $1  [["quotation_id", 2]]
SELECT COUNT(*) FROM "quotations" WHERE "quotations"."approved" = $1  [["approved", "f"]]
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "quotations" WHERE "quotations"."company_id" = $1 LIMIT 1  [["company_id", 1]]

  def create
    @quotation = Quotation.new(quotation_params)
    @quotation.company_id = @company.id
    @quotation.date = Time.now
    if @quotation.approved
      @quotation.date_approved = Time.now
      @quotation.user_appoved_id = current_user.id
    end
    if current_user.rol != 3
      @quotation.approved = false
    end

    @quotation.exam_number = 0
    num_no_exam = 0
    if quotation_params[:quotation_items_attributes].present?
      quotation_params[:quotation_items_attributes].map{|q| num_no_exam  += 1 if q[1][:exam_id] == '' }
      @quotation.exam_number = quotation_params[:quotation_items_attributes].count - num_no_exam
    end

    respond_to do |format|
      if @quotation.save
---
SELECT  "quotations".* FROM "quotations" WHERE "quotations"."company_id" = $1  ORDER BY "quotations"."created_at" ASC LIMIT 1  [["company_id", 6]]
SELECT "exams".* FROM "exams"
SELECT COUNT(*) FROM "users"
INSERT INTO "quotation_items" ("quotation_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["quotation_id", 15], ["created_at", "2017-02-23 09:53:54.594278"], ["updated_at", "2017-02-23 09:53:54.594278"]]
INSERT INTO "quotations" ("description", "approved", "total_users", "city_total", "province_total", "m_units_total", "provinces", "mobile_units", "company_id", "date", "date_approved", "user_appoved_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def update

    @quotation.exam_number = 0
    num_no_exam = 0
    if quotation_params[:quotation_items_attributes].present?
      quotation_params[:quotation_items_attributes].map{|q| num_no_exam  += 1 if (q[1][:exam_id] == '' || q[1][:_destroy] == '1')}
      @quotation.exam_number = quotation_params[:quotation_items_attributes].count - num_no_exam
    end

    if @quotation.approved || @quotation.rejected
      if @quotation.approved
        respond_to do |format|
          format.html { redirect_to current_user.rol == 1 ? quotations_path : quotations_path(:user => 'all'), alert: 'Cotización ya fue aprobada por ' + User.find(@quotation.user_appoved_id).name if @quotation.user_appoved_id }
          format.json { render :show, status: :ok, location: @quotation }
        end
      elsif @quotation.rejected
        respond_to do |format|
          format.html { redirect_to current_user.rol == 1 ? quotations_path : quotations_path(:user => 'all'), alert: 'Cotización fue rechazada' }
          format.json { render :show, status: :ok, location: @quotation }
        end
      end
    else
      respond_to do |format|
        if @quotation.update(quotation_params)
---
SELECT "exams".* FROM "exams"
SELECT  "users".* FROM "users" WHERE "users"."rol" = $1  ORDER BY "users"."id" DESC LIMIT 1  [["rol", 2]]
UPDATE "quotation_items" SET "exam_id" = $1, "city_unit" = $2, "province_unit" = $3, "m_units_unit" = $4, "updated_at" = $5 WHERE "quotation_items"."id" = $6  [["exam_id", 1], ["city_unit", "1.5"], ["province_unit", "2.5"], ["m_units_unit", "3.5"], ["updated_at", "2017-02-23 09:57:55.737950"], ["id", 5]]
UPDATE "quotations" SET "exam_number" = $1, "city_total" = $2, "province_total" = $3, "m_units_total" = $4, "updated_at" = $5 WHERE "quotations"."id" = $6  [["exam_number", 1], ["city_total", "25.0"], ["province_total", "25.0"], ["m_units_total", "34.0"], ["updated_at", "2017-04-05 00:44:25.365371"], ["id", 8]]

  def destroy
    url = @company.present? ? company_quotations_path(@company) : quotations_path
    if current_user.rol == 3
      @quotation.destroy
---
DELETE FROM "quotations" WHERE "quotations"."id" = $1  [["id", 19]]

  def search

    # params[:page] = 1 if params[:page].nil?
    @quotations = Quotation.order(:created_at).reverse_order
    @quotations = @quotations.where("description ILIKE ?", "%#{params[:q]}%").page(params[:page]).per(12)
---
SELECT  "quotations".* FROM "quotations" WHERE (description ILIKE '%tes%')  ORDER BY "quotations"."created_at" DESC LIMIT 12 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "quotations" WHERE (description ILIKE '%tes%') LIMIT 12 OFFSET 0) subquery_for_count

    def set_quotation
      @quotation = Quotation.find(params[:id])
---
SELECT  "quotations".* FROM "quotations" WHERE "quotations"."id" = $1 LIMIT 1  [["id", 19]]